{"id":182,"date":"2024-03-06T21:27:54","date_gmt":"2024-03-06T21:27:54","guid":{"rendered":"http:\/\/userweb"},"modified":"2024-03-06T21:27:54","modified_gmt":"2024-03-06T21:27:54","slug":"what-does-the-stimulus-bill-mean","status":"publish","type":"post","link":"https:\/\/freedomfg.org\/2024\/03\/06\/what-does-the-stimulus-bill-mean\/","title":{"rendered":"What Does the Stimulus Bill Mean"},"content":{"rendered":"\n<p>Though this is a difficult time for small business owners, there are several bright spots on the horizon that could affect your business in a big way. One of those is the stimulus bill, also known as the&nbsp;<a href=\"https:\/\/www.congress.gov\/116\/bills\/hr748\/BILLS-116hr748enr.pdf\">CARES Act<\/a>, that was passed through Congress last month and signed into law on March 27.<\/p>\n\n\n\n<p>While not perfect, the bill is the single biggest economic relief package issued in this country, providing trillions of dollars to corporations, American citizens, and small business owners who seem to be bearing the brunt of this global pandemic.<\/p>\n\n\n\n<p>So if you’re unsure of what the stimulus bill has to offer you and your team, take a look at our list of the 4 ways that this piece of legislation helps small business owners.<\/p>\n\n\n\n<p>4 WAYS THE STIMULUS BILL HELPS SMALL BUSINESS OWNERS<\/p>\n\n\n\n<p>1. $350 billion forgivable loan program<\/p>\n\n\n\n<p>This part of the bill is probably the one you’ve heard the most about. Basically, small businesses have access to $350 billion in forgivable loans during this time if they meet certain requirements. The funds will be available to businesses with fewer than 500 employees and will be administered by The Small Business Administration through banks and other lenders all over the country. Businesses can receive up to $10 million between Jan. 1 and Feb. 29 if they maintain the average size of their workforce. They can use the funds to pay their employees’ salaries, and the principal will be forgiven once this situation ends.<\/p>\n\n\n\n<p>2. 50% refundable payroll tax credit<\/p>\n\n\n\n<p>This tax credit provides 50% of qualified wages for eligible employees during the crisis who are not laid off. If you have more than 100 employees, qualified wages are defined as wages paid to employees who are not providing their services because of the virus. If you have under 100 employees, then all of your employees should meet the requirements for qualified wages. The 50% credit is intended to counterbalance your share of Social Security taxes up to $10,000.<\/p>\n\n\n\n<p>3. Mandatory employee paid sick leave<\/p>\n\n\n\n<p>On its face, it sounds like this provision could go either way for small business owners, but it’s actually a very good thing. In short, the bill provides emergency sick leave for any employees who have to quarantine themselves due to COVID-19. Employees can receive up to $511 per day for up to 10 days. They can also receive up to $200 a day for 10 days if they have to care for a family member or loved one who is suffering from the virus or if they have to care for their children due to school closures.<\/p>\n\n\n\n<p>4. April 15 tax date changed to July 15<\/p>\n\n\n\n<p>Take a deep breath. You’ve probably been scrambling to get your taxes together in the wake of this unprecedented situation and maybe it’s led to some stress. The good news is that you have an extra three months to get those taxes together. This should take a little pressure off this month and give you some time to relax. Don’t completely forget about those taxes, but for now, maybe put your energies toward something more constructive and less stressful.<\/p>\n\n\n\n<p>for Small Businesses?<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Though this is a difficult time for small business owners, there are several bright spots on the horizon that could affect your business in a big way. One of those is the stimulus bill, also known as the&nbsp;CARES Act, that was passed through Congress last month and signed into law on March 27. While not [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":202,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":["post-182","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-uncategorized"],"_links":{"self":[{"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/posts\/182","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/comments?post=182"}],"version-history":[{"count":0,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/posts\/182\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/media\/202"}],"wp:attachment":[{"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/media?parent=182"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/categories?post=182"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/tags?post=182"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}