{"id":184,"date":"2024-03-06T21:27:54","date_gmt":"2024-03-06T21:27:54","guid":{"rendered":"http:\/\/userweb"},"modified":"2024-03-06T21:27:54","modified_gmt":"2024-03-06T21:27:54","slug":"how-to-prepare-your-business","status":"publish","type":"post","link":"https:\/\/freedomfg.org\/2024\/03\/06\/how-to-prepare-your-business\/","title":{"rendered":"How To Prepare Your Business"},"content":{"rendered":"\n<p>For the Coronavirus (COVID-19) Pandemic<\/p>\n\n\n\n<p>With the global spread of the new coronavirus, COVID-19, many small business owners and managers are wondering what they can do to keep their employees, clients, and themselves safe from infection. Though there is still a lot of uncertainty involving COVID-19 and a lot more research needs to be done on the virus, there are several sensible measures that small business owners can take to ensure the safety of their staff.<\/p>\n\n\n\n<p>But first, let’s discuss what we’re dealing with here.<\/p>\n\n\n\n<p>WHAT IS A CORONAVIRUS?<\/p>\n\n\n\n<p>According to the&nbsp;<a href=\"https:\/\/www.who.int\/news-room\/q-a-detail\/q-a-coronaviruses\">World Health Organization<\/a>&nbsp;(WHO), coronaviruses are a family of viruses that often cause respiratory infections. These could be a simple cold or more serious diseases such as Severe Acute Respiratory Syndrome (SARS) or Middle East Respiratory Syndrome (MERS).<\/p>\n\n\n\n<p>COVID-19 is the disease that is caused by this newest coronavirus discovered in Wuhan, China in December of 2019. It has now spread across the globe, infecting tens-of-thousands of people, although the exact numbers are unknown at this point.<\/p>\n\n\n\n<p>What are the Symptoms of COVID-19?<\/p>\n\n\n\n<p>The main symptoms of COVID-19 are<\/p>\n\n\n\n<p>Fever Dry Cough Fatigue Aches &amp; Pains Congestion Runny Nose Sore Throat Diarrhea<\/p>\n\n\n\n<p>For most people, these symptoms are mild and accelerate gradually, though it’s important to note that some people can be infected with the disease but never show symptoms or feel sick at all.<\/p>\n\n\n\n<p>How Does the Virus Spread?<\/p>\n\n\n\n<p>The virus spreads from people who are infected to people who aren’t through respiratory droplets. That is mouth or nose droplets that are expelled when a person coughs, exhales, or sneezes.<\/p>\n\n\n\n<p>You do not have to be in direct contact with someone in order to contract the virus. If you come into contact with an infected person’s respiratory droplets that are expelled on a surface or common object–handle, table, computer, etc.–then it’s possible for you to contract the virus as well. The most common way for someone to contract the virus in this way is if they touch the respiratory droplets of an infected person and then touch their nose, mouth, or eyes.<\/p>\n\n\n\n<p>How You Should Prepare Your Business for COVID-19<\/p>\n\n\n\n<p>To combat this virus and make sure that employees and clients are safe, the&nbsp;<a href=\"https:\/\/www.cdc.gov\/coronavirus\/2019-ncov\/community\/guidance-business-response.html\">CDC encourages<\/a>&nbsp;employers to institute the following best practices:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Actively encourage sick employees to stay home<\/strong>&nbsp;– Employees with acute respiratory illnesses should stay home until their symptoms have disappeared for at least 24 hours and they no longer have a fever. Be flexible with your illness policies and allow sick employees to work from home if possible.<\/li>\n\n\n\n<li><strong>Separate sick employees<\/strong>&nbsp;– Employees who exhibit symptoms should be separated from the rest of the employees and sent home immediately. It’s a good idea to keep all workers at least 3 feet away from each other at all times if possible.<\/li>\n\n\n\n<li><strong>Emphasize respiratory etiquette and hand hygiene by all employees<\/strong>&nbsp;– All employees should cover their mouths and noses with tissues or their elbows when they cough or sneeze at work. Post signs that encourage employees to use best practices and stay home if exhibiting symptoms. Provide your staff with plenty of soap and hand sanitizer that contains at least 60-95% alcohol. Encourage employees to wash their hands for at least 20 seconds multiple times a day.<\/li>\n\n\n\n<li><strong>Perform routine environmental cleaning<\/strong>&nbsp;– Clean surfaces that are touched frequently with disinfectants. These could be handles, doorknobs, keyboards, remote controls, work surfaces, etc. Make sure to provide plenty of disinfectant wipes around your workspaces for this purpose.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>For the Coronavirus (COVID-19) Pandemic With the global spread of the new coronavirus, COVID-19, many small business owners and managers are wondering what they can do to keep their employees, clients, and themselves safe from infection. Though there is still a lot of uncertainty involving COVID-19 and a lot more research needs to be done [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":204,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":["post-184","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-uncategorized"],"_links":{"self":[{"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/posts\/184","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/comments?post=184"}],"version-history":[{"count":0,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/posts\/184\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/media\/204"}],"wp:attachment":[{"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/media?parent=184"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/categories?post=184"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/tags?post=184"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}