{"id":186,"date":"2024-03-06T21:27:54","date_gmt":"2024-03-06T21:27:54","guid":{"rendered":"http:\/\/userweb"},"modified":"2024-03-06T21:27:54","modified_gmt":"2024-03-06T21:27:54","slug":"renegotiate-your-business-lease","status":"publish","type":"post","link":"https:\/\/freedomfg.org\/2024\/03\/06\/renegotiate-your-business-lease\/","title":{"rendered":"Renegotiate Your Business Lease"},"content":{"rendered":"\n<p>In the wake of the COVID-19 pandemic, many business owners are searching for ways to save on their expenses.&nbsp;<strong>Renegotiate Your Business Lease<\/strong>&nbsp;or getting a rent abatement are some options, cutting back on inventory, automating operations, or downsizing your staff, entrepreneurs across the nation are having to make some tough decisions about how to navigate through this new&nbsp;<a href=\"https:\/\/www.marketwatch.com\/story\/what-will-the-stock-market-look-like-in-a-post-coronavirus-world-the-bulls-are-hoping-history-repeats-itself-2020-04-19\">post-coronavirus marketplace<\/a>.<\/p>\n\n\n\n<p>One of the best ways to save on your overhead each month is to renegotiate your business lease to see if you can come to a mutually beneficial agreement with your landlord. Though negotiating with your landlord is a task that few entrepreneurs look forward to making,&nbsp;<a href=\"https:\/\/www.adventuresincre.com\/tenant-sales-occupancy-cost-analysis\/\">occupancy costs<\/a>&nbsp;are serious expenses that affect your bottom line every month.<\/p>\n\n\n\n<p>WHY WOULD MY LANDLORD RENEGOTIATE MY LEASE?<\/p>\n\n\n\n<p>Being business-minded, this is the first question on most business owners’ minds. More than likely you’re somewhere in the middle of your current lease, which means that you’re contractually obligated to pay for the rest of the lease agreement, so why would your landlord agree to take in less revenue?<\/p>\n\n\n\n<p>The main reason a property owner would lower your rent is simply that they don’t want to lose you as a tenant. The housing market is just as precarious as any other industry right now and losing a reliable revenue stream, even if it’s not quite as lucrative as they want, can be a significant blow. Also, you probably have no idea what kind of financial position your landlord is in, unless you have a close relationship, so maybe they can afford to take a hit for the rest of the year knowing that your business will&nbsp;<a href=\"https:\/\/www.wsj.com\/articles\/u-s-companies-lose-hope-for-quick-rebound-from-covid-19-11595151000\">rebound<\/a>&nbsp;in the coming months.<\/p>\n\n\n\n<p>Lastly, they might be more likely to consider a renegotiation if you offer them some kind of incentive for keeping you on as a tenant. This could include deferred interest on a reduced portion of your rent or offering them a percentage of income as a way to make the renegotiation more attractive to your landlord<\/p>\n\n\n\n<p>How Should I Approach My Landlord?<\/p>\n\n\n\n<p>There are several ways that you could go about how to&nbsp;<strong>renegotiate your business lease<\/strong>&nbsp;with your landlord. If you already have a close relationship with them or you know them on a personal level, you probably want to factor this information into your approach.<\/p>\n\n\n\n<p>That being said, here are our best tips for approaching your landlord about a lease renegotiation.&nbsp;<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Speak to them sooner rather than later<\/strong>&nbsp;– If your rent is due in a few days, and you’re only just now broaching the subject with your landlord, it’s probably already too late. Landlords are business owners too and they have to be able to forecast their income just like you. Don’t wait to talk to them until it’s too late.<\/li>\n\n\n\n<li><strong>Talk to them in-person<\/strong>&nbsp;– You don’t necessarily need to set up a face-to-face meeting with your landlord, but make sure you at least speak to them on the phone when you’re renegotiating your business lease. So much gets lost in emails or texts, and your landlord is more likely to say no immediately to an email than to your face.<\/li>\n\n\n\n<li><strong>Attitude is everything<\/strong>&nbsp;– Like most of your business interactions, your attitude when approaching this issue is everything. Don’t act like your landlord owes you a break on the rent or like you’re doing them a favor by being their tenant. Instead, speak to them entrepreneur to entrepreneur and explain the realities of your business right now. Most landlords are aware of how devastating the lockdowns were on small businesses and their tenants.<\/li>\n\n\n\n<li><strong>Recommend a Solution<\/strong>&nbsp;– The next section will deal in more depth about the possible solutions available to you, so for now we’ll simply say, don’t approach your landlord without an idea of how you can solve this situation. Going to them and simply saying that you’d like a rent reduction is not sufficient. Have clear solutions that you both can realistically implement.<\/li>\n\n\n\n<li><strong>Have a Back-Up Plan<\/strong>&nbsp;– What if your landlord flat-out says no? Do you have a plan to deal with that outcome? If you don’t, then you’ll find yourself at loggerheads which is the last place you want to be. Have a plan B in case your landlord disagrees with your first proposed solution and maybe even have a backup plan for that. Being a good&nbsp;<a href=\"https:\/\/www.forbes.com\/sites\/forbescommunicationscouncil\/2018\/07\/19\/five-tips-to-become-a-more-successful-negotiator\/#24b50c057961\">negotiator<\/a>&nbsp;often involves coming back to the table again and again. Be prepared for that outcome.<\/li>\n<\/ul>\n\n\n\n<p>What Are My Options for Renegotiating My Business Lease?<\/p>\n\n\n\n<p>As we mentioned above, offering your landlord an incentive for renegotiating your rent is one way to provide a solution to this problem, but the most common ways to decrease your monthly rental expenses are rent reduction, rent abatement, or partial rent abatement.<\/p>\n\n\n\n<p>Let’s look at each one:<\/p>\n\n\n\n<p><strong>Rent Abatement&nbsp;<\/strong>– This option involves your landlord agreeing to forgo your rent for a certain amount of time, say a few months, with the understanding that you’ll pay it back with interest later down the line. Think of it as a loan. Your landlord is giving you a loan to cover your rent for a certain number of months, and you will pay them back along with the agreed-upon interest when the time is over. This is a particularly good option if your revenue is low right now, but you think that it will pick up again soon.<\/p>\n\n\n\n<p><strong>Partial Rent Abatement<\/strong>&nbsp;– A partial rent abatement is exactly what it sounds like. In this scenario, your landlord abates a portion of your monthly rent instead of the entire thing. Many business owners might feel more comfortable with this option because they don’t have to pay back such a large portion of missed rent later. Remember though, interest still accrues on a partial rent abatement, so make sure you’re factoring that into your plan<\/p>\n\n\n\n<p><strong>Rent Reduction<\/strong>&nbsp;– This is a pretty straightforward way of curbing your rent expense. With this option, you ask your landlord for a reduction in your monthly rent whether it be permanently or for a temporary window of time. The ladder option will probably be more appealing to your landlord, but if you decide to go this route, make sure that you’re considering where your business will be in the future. If you don’t expect much to improve in terms of sales over the next year or so, then a temporary rent reduction might not help you in the long run.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In the wake of the COVID-19 pandemic, many business owners are searching for ways to save on their expenses.&nbsp;Renegotiate Your Business Lease&nbsp;or getting a rent abatement are some options, cutting back on inventory, automating operations, or downsizing your staff, entrepreneurs across the nation are having to make some tough decisions about how to navigate through [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":206,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":["post-186","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-uncategorized"],"_links":{"self":[{"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/posts\/186","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/comments?post=186"}],"version-history":[{"count":0,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/posts\/186\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/media\/206"}],"wp:attachment":[{"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/media?parent=186"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/categories?post=186"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/tags?post=186"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}