{"id":188,"date":"2024-03-06T21:27:54","date_gmt":"2024-03-06T21:27:54","guid":{"rendered":"http:\/\/userweb"},"modified":"2024-03-06T21:27:54","modified_gmt":"2024-03-06T21:27:54","slug":"why-minorities-have-a-harder-time-finding-funding","status":"publish","type":"post","link":"https:\/\/freedomfg.org\/2024\/03\/06\/why-minorities-have-a-harder-time-finding-funding\/","title":{"rendered":"Why Minorities Have A Harder Time Finding Funding"},"content":{"rendered":"\n<p>When looking at the demographics of business loans for minorities, there is a noticeable gap between approval rates for non-minority business owners and minority business owners. Minority owned businesses have a harder time funding funding and getting approved for loans, the reason for which is attributed to many factors.<\/p>\n\n\n\n<p>A 2010 study titled “<a href=\"https:\/\/www.mbda.gov\/page\/executive-summary-disparities-capital-access-between-minority-and-non-minority-businesses\">Disparities in Capital Access between Minority and Non-Minority-Owned Businesses<\/a>” done by the Minority Business Development Agency determined that minority-owned firms are more likely to be denied loans. Among firms with gross receipts under $500,000, loan denial rates for minority firms were at 42% compared to those of non-minority-owned firms at 16%. For high sales firms, the rate of loan denial was almost twice as high for minority firms as for non-minority firms.<\/p>\n\n\n\n<p>The study also found minority-owned firms are more likely to not apply for loans due to rejection fears. Among firms with gross receipts under $500,000, 33% of minority firms did not apply for loans because of fear of rejection compared to 17% of non-minority firms. For high sales firms, 19%of minority firms did not apply for loans because of a fear of rejection compared to 12% of non-minority firms.<\/p>\n\n\n\n<p>WHAT CAUSES THIS DISPARITY?<\/p>\n\n\n\n<p>Much of it comes down to the&nbsp;<a href=\"https:\/\/www.forbes.com\/sites\/forbesfinancecouncil\/2018\/01\/22\/why-minorities-have-so-much-trouble-accessing-small-business-loans\/#4f3b14ec55c4\">bank qualifications<\/a>. Banks require large amounts of collateral, high credit scores and strong revenue, which can be hard to obtain depending on your socioeconomic standing. Despite small business being a vital part of the economy of diverse communities, banks do not commonly give out loans to these minority-owned businesses.<\/p>\n\n\n\n<p>Minority Business Statistics<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>“Between 2007 and 2017 the number minority owned SMBs have grown by 79% reaching 11.1 million. This growth is about 10 times faster than the 7.6% overall growth rate for U.S. small businesses during this period.”&nbsp;<a href=\"https:\/\/www.smallbizlabs.com\/2017\/10\/number-of-minority-owned-us-small-businesses-growing-rapidly.html\">source<\/a><\/li>\n\n\n\n<li>“The populations of five states, including the two largest, California and Texas, are now over 50%&nbsp;<strong>minorities<\/strong>. Many other states, counties, and cities are approaching this threshold, thus understanding minority business ownership is increasingly important.”&nbsp;<a href=\"https:\/\/www.sba.gov\/sites\/default\/files\/advocacy\/Minority-Owned-Businesses-in-the-US.pdf\">source<\/a><\/li>\n\n\n\n<li>“In 2012, 8.0 million minority-owned businesses contributed $1.38 trillion in revenue and 7.2 million jobs to the economy.”&nbsp;<a href=\"https:\/\/www.sba.gov\/sites\/default\/files\/advocacy\/Minority-Owned-Businesses-in-the-US.pdf\">source<\/a><\/li>\n\n\n\n<li>“Minority firms are less likely to be in the top 20 employment industries. Minority-owned businesses make up only 16.8% of businesses in these industries, far less than the 29% average across all industries.”&nbsp;<a href=\"https:\/\/www.sba.gov\/sites\/default\/files\/advocacy\/Minority-Owned-Businesses-in-the-US.pdf\">source<\/a><\/li>\n<\/ul>\n\n\n\n<p>What if minorities are rejected for a bank loan?<\/p>\n\n\n\n<p>The alternative lending industry has been extremely beneficial in helping minorities get the funding they need to run and grow their businesses. While rates are typically higher than a traditional bank loan, merchants with low credit scores, seasonal cash flow, unique industries, no collateral and other former setbacks are able to get short term funding previously unavailable to them. Apply for alternative funding with FundKite where bad credit is accepted and no collateral is needed!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When looking at the demographics of business loans for minorities, there is a noticeable gap between approval rates for non-minority business owners and minority business owners. Minority owned businesses have a harder time funding funding and getting approved for loans, the reason for which is attributed to many factors. A 2010 study titled “Disparities in [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":208,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":["post-188","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-uncategorized"],"_links":{"self":[{"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/posts\/188","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/comments?post=188"}],"version-history":[{"count":0,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/posts\/188\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/media\/208"}],"wp:attachment":[{"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/media?parent=188"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/categories?post=188"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/tags?post=188"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}