{"id":190,"date":"2024-03-06T21:27:54","date_gmt":"2024-03-06T21:27:54","guid":{"rendered":"http:\/\/userweb"},"modified":"2024-03-06T21:27:54","modified_gmt":"2024-03-06T21:27:54","slug":"la-croix-a-lesson-in-branding-for-the-underdog","status":"publish","type":"post","link":"https:\/\/freedomfg.org\/2024\/03\/06\/la-croix-a-lesson-in-branding-for-the-underdog\/","title":{"rendered":"La Croix A Lesson in Branding for the Underdog"},"content":{"rendered":"\n<p>For a change, a trend started in the midwest and made its way to the coasts, rather than the other way around.<\/p>\n\n\n\n<p><a href=\"https:\/\/www.lacroixwater.com\/\">La Croix Water<\/a>&nbsp;(pronounced La Croy) is an American sparkling water brand that most millennials remember seeing their moms drink on beach trips or other events where a sugarless but carbonated alternative for pop was desired. Then, suddenly, the beverage brand started popping up in hipster Brooklyn bars and LA writer’s rooms and nobody could figure out why this tackily designed water was so trendy.<\/p>\n\n\n\n<p>LA CROIX&#8217;S BEGINNINGS<\/p>\n\n\n\n<p>The company started in 1981 in La Crosse, Wisconsin near the St. Croix River, with La Croix meaning “the cross” in French. But don’t be fooled by the fancy sounding name, La Croix is an “Anti-Perrier” brand, specifically marketing to those put off by snobby sparkling water.<\/p>\n\n\n\n<p>The popularity of sparkling water went under the radar in America, as it was primarily consumed only in upscale European restaurants. Then a movement began crusading against sugary pop and other unhealthy beverages contributing to obesity and medical issues. When La Croix was sold to National Beverage in 1992, the company was worth $25M, but ready for a rebrand.<\/p>\n\n\n\n<p><a href=\"https:\/\/www.instagram.com\/LaCroixWater\/\">@La Croix’s<\/a>&nbsp;branding is half of what makes the drink. A design scoffed at by other design agencies and least favored by corporate won over consumer focus groups by a landslide. While other sparkling water companies take a clean and simple approach, La Croix is full of jazzy color and flowing text. A gaudy but resonating design capturing the casual sophistication the design team was hoping for.<\/p>\n\n\n\n<p>La Croix&#8217;s Design<\/p>\n\n\n\n<p>The design of the 12-ounce can won a Gold Global Design Award for packaging in 2003, much to the confusion and amazement of graphic design and brand marketing studios.<\/p>\n\n\n\n<p>Pop consumption plummeted to a 30 year low in the US in 2015. La Croix took this opportunity to introduce Cúrate, a new line of cans and flavors specifically aimed at attracting millennials and boosting social media. The slimmer can, saturated colors and updated flavors led LaCroix to triple its sales within one year of Cúrate’s unveiling.<\/p>\n\n\n\n<p>Expanding its selection from a mere 6 varieties in 2004 to 20 and counting by 2015,&nbsp;<strong>La Croix<\/strong>&nbsp;is the only brand that has been elevated to a lifestyle unto themselves. The seltzer brand has its own page of Etsy crafts, hundreds of thousands of followers on Instagram, an unofficial line of swimsuits, and an unofficial t-shirt line stating “La Croixs Over Boys.” All that’s missing is people naming their kids after the brand!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>For a change, a trend started in the midwest and made its way to the coasts, rather than the other way around. La Croix Water&nbsp;(pronounced La Croy) is an American sparkling water brand that most millennials remember seeing their moms drink on beach trips or other events where a sugarless but carbonated alternative for pop [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":210,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":["post-190","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-uncategorized"],"_links":{"self":[{"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/posts\/190","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/comments?post=190"}],"version-history":[{"count":0,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/posts\/190\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/media\/210"}],"wp:attachment":[{"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/media?parent=190"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/categories?post=190"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/tags?post=190"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}