{"id":191,"date":"2024-03-06T21:27:54","date_gmt":"2024-03-06T21:27:54","guid":{"rendered":"http:\/\/userweb"},"modified":"2024-03-06T21:27:54","modified_gmt":"2024-03-06T21:27:54","slug":"manly-man-company-born-out-of-love","status":"publish","type":"post","link":"https:\/\/freedomfg.org\/2024\/03\/06\/manly-man-company-born-out-of-love\/","title":{"rendered":"Manly Man Company Born Out Of Love"},"content":{"rendered":"\n<p>A “broquet” to end all bouquets…<\/p>\n\n\n\n<p><a href=\"https:\/\/manlymanco.com\/\">The Manly Man Company sells<\/a>&nbsp;hand crafted beef jerky floral bouquets that “are 100% edible and truly are made for that rugged one of a kind, hammer swinging, IPA drinking, duck hunting, beast of a man-animal you call yours.”<\/p>\n\n\n\n<p>The idea for the Manly Man Co. came to Greg Murray after gifting his wife flowers and wondering why there wasn’t a male equivalent. It seemed to him showering women with gifts had many traditional options, but men had virtually no symbols of affection during courtship.<br><\/p>\n\n\n\n<p>MANLY MAN&#8217;S BEGINNINGS<\/p>\n\n\n\n<p>Murray and his wife agreed that beef jerky was a great solution, and even more romantic was flowers made out of beef jerky. Not long after their conversation, Greg’s wife crafted Greg a “Man Bouquet” of sticks of beef jerky with carved flowers wrapped around them, presented in a beer mug, the first broquet prototype.<\/p>\n\n\n\n<p>The company has faced some backlash regarding their exclusive marketing for men; women love jerky, too. Orders began coming in requesting that the bouquet arrive not in a mug that read “Manly Man” on it because the gift was for a woman. While unexpected, Murray is all for catering to this new demographic and is launching a new, gender neutral brand to grow alongside his growing, veteran owned company.<br><\/p>\n\n\n\n<p>Manly Man&#8217;s Success<\/p>\n\n\n\n<p>Murray quickly went from a few employees making bouquets to a full blown operation that goes well into the night before major holidays such as Valentine’s Day, Father’s Day and Christmas. This past Valentine’s Day saw preorders for Valentine’s day as early as October and orders closed several weeks before the holiday.<\/p>\n\n\n\n<p><a href=\"https:\/\/www.instagram.com\/ManlyManCompany\/\">@ Manly Man<\/a>&nbsp;bouquets come in either daisy or rose variations in flavors of original, teriyaki or hot. Since each bouquet is handmade, taking about thirty minutes to craft, orders must be scheduled well in advance. The order arrives pre-arranged in a sealed and stylish box, with the option of adding a “Man Card” bottle opener or “Whisker Damn” beer mug mustache protector.<\/p>\n\n\n\n<p>Sadly for the vegetarians and vegans, there are no kalequets or tofuquets in the works for this company’s product line, but Manly Man Co. is continuing to expand to a bigger location with more merchandise available for customization.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A “broquet” to end all bouquets… The Manly Man Company sells&nbsp;hand crafted beef jerky floral bouquets that “are 100% edible and truly are made for that rugged one of a kind, hammer swinging, IPA drinking, duck hunting, beast of a man-animal you call yours.” The idea for the Manly Man Co. came to Greg Murray [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":211,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":["post-191","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-uncategorized"],"_links":{"self":[{"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/posts\/191","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/comments?post=191"}],"version-history":[{"count":0,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/posts\/191\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/media\/211"}],"wp:attachment":[{"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/media?parent=191"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/categories?post=191"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/tags?post=191"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}