{"id":192,"date":"2024-03-06T21:27:54","date_gmt":"2024-03-06T21:27:54","guid":{"rendered":"http:\/\/userweb"},"modified":"2024-03-06T21:27:54","modified_gmt":"2024-03-06T21:27:54","slug":"classpass-hacking-is-the-sincerest-form-of-flattery","status":"publish","type":"post","link":"https:\/\/freedomfg.org\/2024\/03\/06\/classpass-hacking-is-the-sincerest-form-of-flattery\/","title":{"rendered":"ClassPass Hacking Is The Sincerest Form Of Flattery"},"content":{"rendered":"\n<p>Constantly being hacked could be a sign of flattery from people who really want your business.<\/p>\n\n\n\n<p>Payal Kadakia, founder of&nbsp;<a href=\"https:\/\/classpass.com\/\">ClassPass<\/a>, was smart enough to realize this and change her business model accordingly.<\/p>\n\n\n\n<p>Kadakia didn’t know it at the time, but all of her life experiences were leading her to form a wildly successful start up bringing discounted classes to the people and business to fitness studios. She graduated from MIT in 2005 and much to her parents dismay did not pursue a higher math education but instead in 2009 founded an Indian-themed dance company called Sa, drawing from her years of dance growing up. While her dance company found success performing around New York City, Kadakia felt an entrepreneurial calling to do something more.<br><\/p>\n\n\n\n<p>CLASSPASS&#8217;S HISTORY<\/p>\n\n\n\n<p>One evening, she wanted to take a drop in dance class in New York City, but found there was no platform to find readily available options in one place. Kadakia took it upon herself to create that platform and in 2011 founded Classtivity. But fewer than 100 fitness classes were booked on Classtivity during the company’s first year, and customer retention rates were low.<\/p>\n\n\n\n<p>To add to the struggle, Kadakia was mugged and maced while working on Classtivity in a Starbucks in 2012, just weeks before a venture capitalist meeting in San Francisco. Her laptop and phone were stolen, which Kadakia interpreted as a sign to perfect and strengthen her business.<\/p>\n\n\n\n<p>2013 heralded in plan B. Many customers were repeatedly trying to use their $49 new customer promotion so they could test out a lot of new studios, not a the same ones over and over. This meant it was door to door sales time for Kadakia and co-founder Mary Biggins, pitching to more studios their vague new restructuring of ClassPass.<br><\/p>\n\n\n\n<p>ClassPass&#8217;s Success<\/p>\n\n\n\n<p>Customers wanted to test out a lot of studios, not take the same classes repeatedly. After participating in the Techstars accelerator in 2012, Classtivity was officially rebranded as&nbsp;<a href=\"https:\/\/www.instagram.com\/ClassPass\/\">@ClassPass<\/a>&nbsp;in 2014, a monthly gym-like membership for people who wanted to get in shape with a different workout every time. For roughly $45-$160 a month depending on the city, subscribers can decide between hundreds of local classes such as cycling, yoga, boot camp, swimming, boxing and more. Users can only register for the same venue 3 times a month so ClassPass doesn’t cannibalize its partners’ loyal customers and pricing.<\/p>\n\n\n\n<p>Over 50 million classes have been booked through the platform since its launch in 2013.&nbsp;<strong>ClassPass<\/strong>&nbsp;is located in 50 cities around the world and has raised a total of $173 million from investors, bringing its valuation to $470 million. Kadakia herself boasted a net worth of at least $50 million in 2016, landing her spots on both Forbes’ Women Entrepreneurs to Watch list and Fortune’s 40 under 40.<\/p>\n\n\n\n<p>After leading the company for 4 years, Kadakia stepped down as ClassPass CEO in March 2017. She currently serves as executive chairman of the company, stating that she feels happier and more effective in a creative role, despite those saying she should remain CEO simply because a woman should be CEO if she can.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Constantly being hacked could be a sign of flattery from people who really want your business. Payal Kadakia, founder of&nbsp;ClassPass, was smart enough to realize this and change her business model accordingly. Kadakia didn’t know it at the time, but all of her life experiences were leading her to form a wildly successful start up [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":212,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":["post-192","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-uncategorized"],"_links":{"self":[{"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/posts\/192","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/comments?post=192"}],"version-history":[{"count":0,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/posts\/192\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/media\/212"}],"wp:attachment":[{"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/media?parent=192"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/categories?post=192"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/freedomfg.org\/wp-json\/wp\/v2\/tags?post=192"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}